agency-services-transunion/lib/examples/mocks/MockPersonalRecordTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data"
  xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
  <soapenv:Header/>
  <soapenv:Body>
    <con:StartDispute>
      <con:request>
        <data:AccountCode>123456789</data:AccountCode>
        <data:AccountName>CC2BraveCredit</data:AccountName>
        <data:RequestKey>BC-de4f89f0-44ef-479a-ae5d-61d5e46b6164</data:RequestKey>
        <data:ClientKey>27f7ff41-9229-4224-857a-d24ecb8804fd</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>5112 Walnut Ridge Dr</data:AddressLine1>
            <data:AddressLine2 xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:City>Des Moines</data:City>
            <data:State>IA</data:State>
            <data:Zipcode>50317</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>1944-02-01</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>Jennifer</data:FirstName>
            <data:LastName>Reintjes</data:LastName>
            <data:MiddleName>Jane</data:MiddleName>
            <data:Prefix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Suffix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          </data:FullName>
          <data:PhoneNumber xsi:nil="true"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          <data:Ssn>666305050</data:Ssn>
          <data:Identifier>
            <data:CustomerIdentifier>
              <data:Id>666305050</data:Id>
              <data:IdentifierType>SocialId</data:IdentifierType>
            </data:CustomerIdentifier>
          </data:Identifier>
        </data:Customer>
        <data:Employers>
          <data:Employer>
            <data:City xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Delete>true</data:Delete>
            <data:Directional xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:EndDate xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:HouseNumber xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Name>EMPLOYER X</data:Name>
            <data:Number xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Occupation xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:StartDate xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:State xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:StreetName xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:ThoroughFare xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:ZipCode xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:ZipCodeExt xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          </data:Employer>
        </data:Employers>
        <data:EnrollmentKey>4736c410-f9c7-42e3-9fb4-6eb71eff567c</data:EnrollmentKey>
        <data:IndicativeDisputes xsi:nil="true"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <data:LineItems xsi:nil="true"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <data:ServiceBundleFulfillmentKey>6c67e360-e622-41c0-b31d-6c578ee3c70a</data:ServiceBundleFulfillmentKey>
      </con:request>
    </con:StartDispute>
  </soapenv:Body>
</soapenv:Envelope>